---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.#ctor
source: html/33f0c818-a709-d476-587e-cf80714bf5d9.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.#ctor Method

Creates a new instance of an OverrideGraphicSettings object.

## Syntax (C#)
```csharp
public OverrideGraphicSettings()
```